## Part 1

In [1]:
import pandas as pd

In [2]:
keys = ['Year', 'Team', 'Country']

values = [[1975,1979,183,1987,1992,1996,1999,2003,2007,2011,2015],
               ['West Ind','West Ind','India','Australia','Pakistan','Sri Lanka', 'Australia','Australia','Australia','India','Australia'],
               ['England','England','England','India','Australia','India','England','South Africa','West Ind','India','Australia']
                ]

In [6]:
zipp = list(zip(keys, values))
print(zipp)

[('Year', [1975, 1979, 183, 1987, 1992, 1996, 1999, 2003, 2007, 2011, 2015]), ('Team', ['West Ind', 'West Ind', 'India', 'Australia', 'Pakistan', 'Sri Lanka', 'Australia', 'Australia', 'Australia', 'India', 'Australia']), ('Country', ['England', 'England', 'England', 'India', 'Australia', 'India', 'England', 'South Africa', 'West Ind', 'India', 'Australia'])]

In [7]:
data_dict = dict(zipp)
print(data_dict)

{'Year': [1975, 1979, 183, 1987, 1992, 1996, 1999, 2003, 2007, 2011, 2015], 'Team': ['West Ind', 'West Ind', 'India', 'Australia', 'Pakistan', 'Sri Lanka', 'Australia', 'Australia', 'Australia', 'India', 'Australia'], 'Country': ['England', 'England', 'England', 'India', 'Australia', 'India', 'England', 'South Africa', 'West Ind', 'India', 'Australia']}

In [9]:
df = pd.DataFrame(data_dict)
df

    Year       Team       Country
0   1975   West Ind       England
1   1979   West Ind       England
2    183      India       England
3   1987  Australia         India
4   1992   Pakistan     Australia
5   1996  Sri Lanka         India
6   1999  Australia       England
7   2003  Australia  South Africa
8   2007  Australia      West Ind
9   2011      India         India
10  2015  Australia     Australia

## Part 2

In [10]:
df = pd.DataFrame()

df['col1'] = ['Imran','Kazi','Amar','Ramesh','Steve']
df['col2'] = ['Simran','Steve','Rejish','Imran','Estefan']

In [11]:
df['exist1'] = df['col1'].isin(df['col2'])
df['exist1']

0     True
1    False
2    False
3    False
4     True
Name: exist1, dtype: bool

In [13]:
df['exist2'] = df['col2'].isin(df['col1'])
df['exist2']

0    False
1     True
2    False
3     True
4    False
Name: exist2, dtype: bool

In [14]:
df[df['exist1'] == True]

    col1     col2  exist1  exist2
0  Imran   Simran    True   False
4  Steve  Estefan    True   False

In [15]:
df[df['exist2'] == True]

     col1   col2  exist1  exist2
1    Kazi  Steve   False    True
3  Ramesh  Imran   False    True

## Part 3

In [18]:
df = pd.DataFrame()

df['ID'] = [1111,2222,3333,4444,5555]
df['Name'] = ['Venkat','Sridhar','Shaqib','Nitin','Dupesh']
df['City'] = ['Hyderabad','Kolkata','Mumbai','Bangalore','Jaipur']

city_to_state = {'Hyderabad' :'Telangana',
                 'Kolkata':'West Bengal',
                 'Jaipur': ' Rajasthan',
                 'Bangalore': 'Karnataka',
                 'Mumbai': 'Maharastra'}

df['State'] = df['City'].map(city_to_state)
'''
df1 = pd.read_excel('city-state.xlsx',0)


df2 = pd.read_excel('city-state.xlsx',1)

city_to_state1 = dict(zip(df2.City,df2.State))

df1['State'] = df1['City'].map(city_to_state1)
'''
df

     ID     Name       City        State
0  1111   Venkat  Hyderabad    Telangana
1  2222  Sridhar    Kolkata  West Bengal
2  3333   Shaqib     Mumbai   Maharastra
3  4444    Nitin  Bangalore    Karnataka
4  5555   Dupesh     Jaipur    Rajasthan